In [1]:
 # pip install --upgrade pandas
import pandas as pd
data = pd.read_csv("Titanic.csv")

## Q1. List any five functions of the pandas library with execution.

In [2]:
# head - first 5 row
data.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [3]:
# tail  - last 5 row
data.tail()

                        Name PClass   Age   Sex  Survived
1308      Zakarian, Mr Artun    3rd  27.0  male         0
1309  Zakarian, Mr Maprieder    3rd  26.0  male         0
1310        Zenni, Mr Philip    3rd  22.0  male         0
1311        Lievens, Mr Rene    3rd  24.0  male         0
1312          Zimmerman, Leo    3rd  29.0  male         0

In [4]:
# info - for summary 
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1312 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 51.4+ KB

In [5]:
# dtypes - for data types
data.dtypes

Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
dtype: object

In [6]:
# describe = for quick summary
data.describe()

              Age     Survived
count  756.000000  1313.000000
mean    30.397989     0.342727
std     14.259049     0.474802
min      0.170000     0.000000
25%     21.000000     0.000000
50%     28.000000     0.000000
75%     39.000000     1.000000
max     71.000000     1.000000

____________

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
data.index = data.index + 1
data.rename(columns = {'Name':'A','PClass':'B','Age':'C'}, inplace=True)
data.head()

                                               A    B      C     Sex  Survived
1                   Allen, Miss Elisabeth Walton  1st  29.00  female         1
2                    Allison, Miss Helen Loraine  1st   2.00  female         0
3            Allison, Mr Hudson Joshua Creighton  1st  30.00    male         0
4  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  1st  25.00  female         0
5                  Allison, Master Hudson Trevor  1st   0.92    male         1

_________

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
>For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [8]:
data1 = {'column':[1,2,5,9,10],
        'values' :[10, 20, 30, 40, 50],}
data2 = pd.DataFrame(data1)
print(data2['values'][0:3].sum())

60

__________

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column  'Word_Count' that contains the number of words in each row of the 'Text' column.

In [10]:
data4['Word_Count'] = data4['A'].apply(lambda x: len(str(x).split()))
data4

NameError: name 'data4' is not defined

### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
data.size

In [ ]:
si = data.size
sp = data.shape
print('Size = ', si, 'shape =', sp)

_________

### Q6. Which function of pandas do we use to read an excel file?

In [ ]:
data6 = pd.read_excel('SampleData.xlsx',sheet_name='SalesOrders').head()
data6

_______

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

>The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [ ]:
for i in range(len(data6)):
    data6.loc[i, 'Email'] = data6.loc[i,'Region']+"@domain.com"
data6

_____________

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
>For example, if df contains the following values:

>>A B C

>>0 3 5 1

>>1 8 2 7

>>2 6 9 4

>>3 2 3 5

>>4 9 1 2

In [ ]:
da = {"A" : [3,8,6,2,9], 'B' : [5,2,9,3,1], "C" : [1,7,4,5,2]}
da = pd.DataFrame(da)
da

In [ ]:
a = [i for i in list(da['A']) if i >5]
b= [i for i in list(da['B']) if i <10]
# a, b
if len(a)>len(b):
    gap = len(a)-len(b)
    for i in range(gap):
        b.append('NaN')
elif len(a)<len(b):
    gap = len(b)-len(a)
    for i in range(gap):
        a.append('NaN')
  

        
d = {'A':a,"B":b}
pd.DataFrame(d)

____________